# SQL Exercise (10 points)

The homework assignment is due by the end of the day on Thursday, October 2.

Please make sure to solve the assignment problems yourself and obey the university's policies on academic honesty and integrity. Remember that copying and pasting solutions from AI coding assistants, webpages, classmates, or anywhere else is considered plagiarism and academic dishonesty. 

**Note that your solutions are expected to follow the code examples provided in the lecture notes. If your solution to a problem uses functions or codes that are not covered in the lecture notes, that will result in zero marks assigned for that problem.**

To avoid potential conflicts between variable names, it is recommended to restart the kernel often or restart it for every new problem by selecting `Kernel -> Restart Kernel...`. Also, when you have completed all problems and before submitting the notebook, it is recommended to select `Kernel -> Restart Kernel and Run All Cells...` to ensure that all cells execute correctly without errors.

SQL exercise: 10 points

Total points for Assignment 3: 25 points

Complete this exercise using SQLite. 

To work with SQLite, first install `ipython-sql` (e.g., via 'pip install ipython-sql').

## Part 1 (4 points)

(1.1) Create the following table named `Products` that has 4 columns with 10 records. Set the `Code` column to be the Primary Key. 

If you have many errors in your code, it helps to restart the kernel by clicking on `Kernel` -> `Restart Kernel` in the top menu, and run again the cells.

In [1]:
%pip install ipython-sql sqlalchemy prettytable -q
%reload_ext sql

Note: you may need to restart the kernel to use updated packages.

In [2]:
%%sql sqlite://

-- Create Products table
CREATE TABLE products(
    Code INTEGER NOT NULL PRIMARY KEY,
    Name TEXT NOT NULL,
    Price INTEGER NOT NULL,
    Manufacturer TEXT NOT NULL
);

INSERT INTO products VALUES (1,'Hard drive',240,'Fujitsu');
INSERT INTO products VALUES (2,'Memory',120,'Winchester');
INSERT INTO products VALUES (3,'ZIP drive',150,'Iomega');
INSERT INTO products VALUES (4,'Floppy disk',5,'Winchester');
INSERT INTO products VALUES (5,'Monitor',240,'Sony');
INSERT INTO products VALUES (6,'DVD drive',180,'Creative Labs');
INSERT INTO products VALUES (7,'CD drive',90,'Creative Labs');
INSERT INTO products VALUES (8,'Printer',270,'Hewlett-Packard');
INSERT INTO products VALUES (9,'Toner cartridge',66,'Hewlett-Packard');
INSERT INTO products VALUES (10,'DVD burner',180,'Creative Labs');

SELECT * FROM products;

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Hard drive', 240, 'Fujitsu'),
 (2, 'Memory', 120, 'Winchester'),
 (3, 'ZIP drive', 150, 'Iomega'),
 (4, 'Floppy disk', 5, 'Winchester'),
 (5, 'Monitor', 240, 'Sony'),
 (6, 'DVD drive', 180, 'Creative Labs'),
 (7, 'CD drive', 90, 'Creative Labs'),
 (8, 'Printer', 270, 'Hewlett-Packard'),
 (9, 'Toner cartridge', 66, 'Hewlett-Packard'),
 (10, 'DVD burner', 180, 'Creative Labs')]

(1.2) Select the names of all the products in the store.

In [3]:
%%sql
SELECT Name FROM products;

 * sqlite://
Done.

[('Hard drive',),
 ('Memory',),
 ('ZIP drive',),
 ('Floppy disk',),
 ('Monitor',),
 ('DVD drive',),
 ('CD drive',),
 ('Printer',),
 ('Toner cartridge',),
 ('DVD burner',)]

(1.3) Select the names of the products with a price less than or equal to $200. Display product names and prices.

In [5]:
%%sql
SELECT Name, Price
FROM products
WHERE price <= 200;

 * sqlite://
Done.

[('Memory', 120),
 ('ZIP drive', 150),
 ('Floppy disk', 5),
 ('DVD drive', 180),
 ('CD drive', 90),
 ('Toner cartridge', 66),
 ('DVD burner', 180)]

(1.4) Select all products with a price between $60 and 200. Display product names and prices, sorted by ascending price.

In [6]:
%%sql
SELECT Name, Price
FROM products
WHERE price BETWEEN 60 AND 200
ORDER BY price ASC;

 * sqlite://
Done.

[('Toner cartridge', 66),
 ('CD drive', 90),
 ('Memory', 120),
 ('ZIP drive', 150),
 ('DVD drive', 180),
 ('DVD burner', 180)]

(1.5) Select the name and price of all products, and display the price in cents (instead of dollars).

In [7]:
%%sql
SELECT Name, Price * 100 AS "Price (Cents)"
FROM products;

 * sqlite://
Done.

[('Hard drive', 24000),
 ('Memory', 12000),
 ('ZIP drive', 15000),
 ('Floppy disk', 500),
 ('Monitor', 24000),
 ('DVD drive', 18000),
 ('CD drive', 9000),
 ('Printer', 27000),
 ('Toner cartridge', 6600),
 ('DVD burner', 18000)]

(1.6) Compute the average price of all products from the manufacturer 'Creative Labs'.

In [8]:
%%sql
SELECT AVG(price) AS "Average Price"
FROM products
WHERE manufacturer = 'Creative Labs';

 * sqlite://
Done.

[(150.0,)]

(1.7) Compute the number of products with a price larger than or equal to $180.

In [9]:
%%sql
SELECT COUNT(*) AS "COUNT(*)"
FROM products
WHERE price >= 180;

 * sqlite://
Done.

[(5,)]

(1.8) Select the name and price of all products with a price larger than or equal to $180, and sort them by price in descending order.

In [11]:
%%sql
SELECT Name, Price
FROM products
WHERE price >= 180
ORDER BY price DESC;

 * sqlite://
Done.

[('Printer', 270),
 ('Hard drive', 240),
 ('Monitor', 240),
 ('DVD drive', 180),
 ('DVD burner', 180)]

(1.9) Select the manufacturers and the average price of each manufacturer's products.

In [12]:
%%sql
SELECT manufacturer, AVG(price) AS "Average Price"
FROM products
GROUP BY manufacturer;

 * sqlite://
Done.

[('Creative Labs', 150.0),
 ('Fujitsu', 240.0),
 ('Hewlett-Packard', 168.0),
 ('Iomega', 150.0),
 ('Sony', 240.0),
 ('Winchester', 62.5)]

(1.10) Select the manufacturers whose products have an average price larger than or equal to $160.

In [13]:
%%sql
SELECT AVG(price) AS "AVG(Price)", manufacturer AS "Manufacturer"
FROM products
GROUP BY manufacturer
HAVING AVG(price) >= 160;

 * sqlite://
Done.

[(240.0, 'Fujitsu'), (168.0, 'Hewlett-Packard'), (240.0, 'Sony')]

(1.11) Select the name and price of the cheapest product.

In [14]:
%%sql
SELECT name, price
FROM products
ORDER BY price ASC
LIMIT 1;

 * sqlite://
Done.

[('Floppy disk', 5)]

(1.12) Select the name of each manufacturer along with the name and price of its most expensive product, and sort them by price in descending order.

In [16]:
%%sql
SELECT manufacturer AS "Manufacturer",
       MAX(price) AS "Most Expensive (Price)"
FROM products
GROUP BY manufacturer
ORDER BY "Most Expensive (Price)" DESC;

 * sqlite://
Done.

[('Hewlett-Packard', 270),
 ('Sony', 240),
 ('Fujitsu', 240),
 ('Creative Labs', 180),
 ('Iomega', 150),
 ('Winchester', 120)]

(1.13) Update the name of product 8 to "Laser Printer", and display the updated names.

In [17]:
%%sql
UPDATE products
SET name = 'Laser Printer'
WHERE code = 8;

SELECT name AS "Name"
FROM products;

 * sqlite://
1 rows affected.
Done.

[('Hard drive',),
 ('Memory',),
 ('ZIP drive',),
 ('Floppy disk',),
 ('Monitor',),
 ('DVD drive',),
 ('CD drive',),
 ('Laser Printer',),
 ('Toner cartridge',),
 ('DVD burner',)]

(1.14) Apply a 10% discount to all products. Display the product names and updated prices.

In [28]:
%%sql
SELECT name AS "Name",
       price * 0.9 AS "Price"
FROM products;

 * sqlite://
Done.

[('Hard drive', 216.0),
 ('Memory', 108.0),
 ('ZIP drive', 135.0),
 ('Floppy disk', 4.5),
 ('Monitor', 216.0),
 ('DVD drive', 162.0),
 ('CD drive', 81.0),
 ('Laser Printer', 243.0),
 ('Toner cartridge', 59.4),
 ('DVD burner', 162.0)]

(1.15) Apply an additional 20% discount to all products with a price larger than or equal to $120.

In [31]:
%%sql
SELECT name AS "Name",
       TRIM(TRIM(ROUND(
           CASE 
               WHEN price * 0.9 >= 120 THEN price * 0.9 * 0.8 
               ELSE price * 0.9                               
           END, 2), '0'), '.') AS "Price"
FROM products
ORDER BY code;

 * sqlite://
Done.

[('Hard drive', '172.8'),
 ('Memory', '108'),
 ('ZIP drive', '108'),
 ('Floppy disk', '4.5'),
 ('Monitor', '172.8'),
 ('DVD drive', '129.6'),
 ('CD drive', '81'),
 ('Laser Printer', '194.4'),
 ('Toner cartridge', '59.4'),
 ('DVD burner', '129.6')]

Delete the table from Part 1.

In [32]:
%%sql
DROP TABLE IF EXISTS products;

 * sqlite://
Done.

[]

# Part 2 (3 points)

Run the code in the following cell to create a database containing information about employees and departments in a small business.

In [33]:
%%sql sqlite://
CREATE TABLE Departments (
  Code INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  Budget decimal NOT NULL 
);

CREATE TABLE Employees (
  SSN INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  LastName varchar(255) NOT NULL ,
  Department INTEGER NOT NULL , 
  foreign key (department) references Departments(Code) 
);

INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','ODonnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

(2.1) Select the last name of all employees.

In [35]:
%%sql
SELECT LastName AS "LastName"
FROM Employees;

 * sqlite://
Done.

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ('ODonnell',),
 ('Doe',),
 ('Smith',),
 ('Efron',),
 ('Goldsmith',),
 ('Doe',),
 ('Swamy',)]

(2.2) Select the last name of all employees, without duplicates. Sort them in alphabetical order.

In [37]:
%%sql
SELECT DISTINCT LastName AS "LastName"
FROM Employees
ORDER BY LastName ASC;

 * sqlite://
Done.

[('Doe',),
 ('Efron',),
 ('Foster',),
 ('Goldsmith',),
 ('Manikutty',),
 ('ODonnell',),
 ('Rogers',),
 ('Smith',),
 ('Stevens',),
 ('Swamy',)]

(2.3) Select all the data of employees whose last name is "Smith" or "Doe".

In [39]:
%%sql
SELECT SSN, Name, LastName, Department
FROM Employees
WHERE LastName = 'Smith' OR LastName = 'Doe';

 * sqlite://
Done.

[(222364883, 'Carol', 'Smith', 37),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (845657245, 'Elizabeth', 'Doe', 14)]

(2.4) Select all the data of employees whose last name begins with an "S".

In [40]:
%%sql
SELECT SSN, Name, LastName, Department
FROM Employees
WHERE LastName LIKE 'S%';

 * sqlite://
Done.

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (631231482, 'David', 'Smith', 77),
 (845657246, 'Kumar', 'Swamy', 14)]

(2.5) Select the number of employees in each department, and display the name of each department and the number of employees per department.

In [41]:
%%sql
SELECT d.Name AS "Name", COUNT(*) AS "COUNT(*)"
FROM Employees e
JOIN Departments d ON e.Department = d.Code
GROUP BY d.Name
ORDER BY d.Name;

 * sqlite://
Done.

[('Accounting', 2), ('Human Resources', 3), ('IT', 5), ('Research', 2)]

(2.6) Select the name and last name of employees working for the departments that have a budget greater than $60,000.

In [43]:
%%sql
SELECT e.Name AS "Name", e.LastName AS "LastName"
FROM Employees e
JOIN Departments d ON e.Department = d.Code
WHERE d.Budget > 60000;

 * sqlite://
Done.

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy')]

(2.7) Select the names of departments with more than two employees (e.g., you can use a subquery).

In [45]:
%%sql
SELECT Name AS "Name"
FROM Departments
WHERE Code IN (
    SELECT Department
    FROM Employees
    GROUP BY Department
    HAVING COUNT(*) > 2
);

 * sqlite://
Done.

[('IT',), ('Human Resources',)]

(2.8) Reduce the budget of all departments by 10%. Display the Departments table to verify the changes.

In [46]:
%%sql
UPDATE Departments
SET Budget = Budget * 0.9;

SELECT Code AS "Code", Name AS "Name", Budget AS "Budget"
FROM Departments
ORDER BY Code;

 * sqlite://
4 rows affected.
Done.

[(14, 'IT', 58500),
 (37, 'Accounting', 13500),
 (59, 'Human Resources', 216000),
 (77, 'Research', 49500)]

(2.9) Reassign all employees from the Research department (code 77) to the IT department (code 14). Display the Employees table to verify the change.

In [48]:
%%sql
UPDATE Employees
SET Department = 14
WHERE Department = 77;

SELECT SSN AS "SSN", Name AS "Name", LastName AS "LastName", Department AS "Department"
FROM Employees
ORDER BY SSN;

 * sqlite://
0 rows affected.
Done.

[(123234877, 'Michael', 'Rogers', 14),
 (152934485, 'Anand', 'Manikutty', 14),
 (222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (332154719, 'Mary-Anne', 'Foster', 14),
 (332569843, 'George', 'ODonnell', 14),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 14),
 (654873219, 'Zacary', 'Efron', 59),
 (745685214, 'Eric', 'Goldsmith', 59),
 (845657245, 'Elizabeth', 'Doe', 14),
 (845657246, 'Kumar', 'Swamy', 14)]

(2.10) Delete the tables `Departments` and `Employees` in the current database.

In [49]:
%%sql
DROP TABLE IF EXISTS Employees;
DROP TABLE IF EXISTS Departments;

 * sqlite://
Done.
Done.

[]

# Part 3 (3 points)

(3.1) Connect to the database named `demo.db` located in the `data` folder. Follow the example codes covered in the lecture notes.

In [50]:
%sql sqlite:///data/demo.db

(3.2) Select the names of all tables in the database.

In [53]:
%%sql
SELECT name
FROM sqlite_master
WHERE type='table';

   sqlite://
 * sqlite:///data/demo.db
Done.

[('Employee',),
 ('Category',),
 ('Customer',),
 ('Shipper',),
 ('Product',),
 ('OrderDetail',)]

(3.3) Select the names of all categories in the Category table.

In [57]:
%%sql
SELECT Id, CategoryName, Description
FROM Category;

   sqlite://
 * sqlite:///data/demo.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses'),
 (5, 'Grains/Cereals', 'Breads, crackers, pasta, and cereal'),
 (6, 'Meat/Poultry', 'Prepared meats'),
 (7, 'Produce', 'Dried fruit and bean curd'),
 (8, 'Seafood', 'Seaweed and fish')]

(3.4) Select the names of all categories, description of categories, and the number of products per category (e.g., use the `CategoryID` column in the `Product` table to relate to the `ID` column in the `Category` table).

In [60]:
%%sql
SELECT c.CategoryName AS "CategoryName",
       c.Description  AS "Description",
       COUNT(p.Id)    AS "Count"
FROM Category c
JOIN Product p
  ON c.Id = p.CategoryID
GROUP BY c.CategoryName, c.Description
ORDER BY c.CategoryName;

   sqlite://
 * sqlite:///data/demo.db
Done.

[('Beverages', 'Soft drinks, coffees, teas, beers, and ales', 12),
 ('Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings', 12),
 ('Confections', 'Desserts, candies, and sweet breads', 13),
 ('Dairy Products', 'Cheeses', 10),
 ('Grains/Cereals', 'Breads, crackers, pasta, and cereal', 7),
 ('Meat/Poultry', 'Prepared meats', 6),
 ('Produce', 'Dried fruit and bean curd', 5),
 ('Seafood', 'Seaweed and fish', 12)]

(3.5) From the `Customer` table, select the names of 3 countries with the largest number of customers per country (e.g., use the `Country` column in the `Customer` table, and create a subquery for the number of customers per country).

In [62]:
%%sql
SELECT Country AS "Country",
       COUNT(*) AS "Number of Customers"
FROM Customer
GROUP BY Country
ORDER BY COUNT(*) DESC
LIMIT 3;

   sqlite://
 * sqlite:///data/demo.db
Done.

[('USA', 13), ('Germany', 11), ('France', 11)]

(3.6) Count the number of discontinued products (in the `Product` table, 1 in the `Discontinued` column means that the product is discontinued).

In [64]:
%%sql
SELECT COUNT(*) AS "Discontinued Products"
FROM Product
WHERE Discontinued = 1;

   sqlite://
 * sqlite:///data/demo.db
Done.

[(8,)]

(3.7) Select products that cost between $20 and 25 and are not discontinued. Display product name and unit price, sorted by price in descending order.

In [69]:
%%sql
SELECT ProductName AS "ProductName",
       UnitPrice   AS "UnitPrice"
FROM Product
WHERE UnitPrice BETWEEN 20 AND 25
  AND Discontinued = 0
ORDER BY UnitPrice DESC;

   sqlite://
 * sqlite:///data/demo.db
Done.

[("Grandma's Boysenberry Spread", 25),
 ('Pt chinois', 24),
 ('Tofu', 23.25),
 ("Chef Anton's Cajun Seasoning", 22),
 ('Flotemysost', 21.5),
 ('Louisiana Fiery Hot Pepper Sauce', 21.05),
 ('Queso Cabrales', 21),
 ("Gustaf's Knckebrd", 21),
 ('Maxilaku', 20)]

(3.8) Select the five most expensive products, and display the product name and unit price.

In [70]:
%%sql
SELECT ProductName AS "ProductName",
       UnitPrice   AS "UnitPrice"
FROM Product
ORDER BY UnitPrice DESC
LIMIT 5;

   sqlite://
 * sqlite:///data/demo.db
Done.

[('Cte de Blaye', 263.5),
 ('Thringer Rostbratwurst', 123.79),
 ('Mishi Kobe Niku', 97),
 ("Sir Rodney's Marmalade", 81),
 ('Carnarvon Tigers', 62.5)]